In [1]:
import pandas as pd

In [3]:
data={
    "names":['a','b','c'],
    "ages":[25,28,21]
}

In [4]:
df=pd.DataFrame(data)

In [5]:
df

  names  ages
0     a    25
1     b    28
2     c    21

In [9]:
df.head(1)

  names  ages
0     a    25

In [10]:
df.tail(1)

  names  ages
2     c    21

In [6]:
df.describe()

            ages
count   3.000000
mean   24.666667
std     3.511885
min    21.000000
25%    23.000000
50%    25.000000
75%    26.500000
max    28.000000

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   names   3 non-null      object
 1   ages    3 non-null      int64
dtypes: int64(1), object(1)
memory usage: 180.0+ bytes

In [14]:
df.dtypes

names    object
ages      int64
dtype: object

In [16]:
#rename the column names in the exisiting dataframe
df.columns=["emp_name","age"]
df

  emp_name  age
0        a   25
1        b   28
2        c   21

In [25]:
#Rename in new data frame not the exisiting one
df2 = df.rename(columns={"emp_name":"emp_first_name","age":"emp_age"})
df2

  emp_first_name  emp_age
0              a       25
1              b       28
2              c       21

In [27]:
# Adding a new Column
dept = ["Sales","Marketing","IT"]

df=df.assign(Company=dept)
df

  emp_name  age    Company
0        a   25      Sales
1        b   28  Marketing
2        c   21         IT

In [29]:
df.dtypes

emp_name    object
age          int64
Company     object
dtype: object

In [30]:
df3=df.convert_dtypes()
df3

  emp_name  age    Company
0        a   25      Sales
1        b   28  Marketing
2        c   21         IT

In [31]:
df3.dtypes

emp_name    string
age          Int64
Company     string
dtype: object

In [39]:
df4=df.astype({"age":float})

In [38]:
df4.dtypes

emp_name     object
age         float64
Company      object
dtype: object

In [44]:
df.shape

(3, 3)

In [45]:
df2.shape

(3, 2)

In [48]:
display(df)

  emp_name  age    Company
0        a   25      Sales
1        b   28  Marketing
2        c   21         IT

In [49]:
technologies = {
    'Courses':["Spark","PySpark","Hadoop","Python","pandas"],
    'Fee' :[20000,25000,26000,22000,24000],
    'Duration':['30day','40days','35days','40days','60days'],
    'Discount':[1000,2300,1200,2500,2000]
              }

In [51]:
df=pd.DataFrame(technologies)

In [52]:
df

   Courses    Fee Duration  Discount
0    Spark  20000    30day      1000
1  PySpark  25000   40days      2300
2   Hadoop  26000   35days      1200
3   Python  22000   40days      2500
4   pandas  24000   60days      2000

In [57]:
index_lable = ['r1','r2','r3','r4','r5']
df=pd.DataFrame(technologies, index=index_lable)
df

    Courses    Fee Duration  Discount
r1    Spark  20000    30day      1000
r2  PySpark  25000   40days      2300
r3   Hadoop  26000   35days      1200
r4   Python  22000   40days      2500
r5   pandas  24000   60days      2000

In [62]:
df.loc[['r1','r3']]

   Courses    Fee Duration  Discount
r1   Spark  20000    30day      1000
r3  Hadoop  26000   35days      1200

In [60]:
df.loc[:,['Courses']]

    Courses
r1    Spark
r2  PySpark
r3   Hadoop
r4   Python
r5   pandas

In [66]:
df.loc[df["Fee"]>=24000]

    Courses    Fee Duration  Discount
r2  PySpark  25000   40days      2300
r3   Hadoop  26000   35days      1200
r5   pandas  24000   60days      2000

In [73]:
df.query("Courses=='PySpark'")

    Courses    Fee Duration  Discount
r2  PySpark  25000   40days      2300

In [74]:
df.query("Courses!='PySpark'")

   Courses    Fee Duration  Discount
r1   Spark  20000    30day      1000
r3  Hadoop  26000   35days      1200
r4  Python  22000   40days      2500
r5  pandas  24000   60days      2000

In [76]:
df1=df.drop("Discount", axis=1)

In [77]:
df1

    Courses    Fee Duration
r1    Spark  20000    30day
r2  PySpark  25000   40days
r3   Hadoop  26000   35days
r4   Python  22000   40days
r5   pandas  24000   60days

In [81]:
df1=df.drop(columns="Discount")

In [82]:
df1

    Courses    Fee Duration
r1    Spark  20000    30day
r2  PySpark  25000   40days
r3   Hadoop  26000   35days
r4   Python  22000   40days
r5   pandas  24000   60days

In [83]:
emp_df=pd.read_csv("Dataset/emp.csv")

In [84]:
emp_df

   id name  age gender
0   1    a   27      M
1   2    b   25      F
2   3    c   24      F
3   4    d   22      M
4   5    e   26      M

In [120]:
emp_df=pd.read_csv("Dataset/employee.csv")

In [121]:
emp_df

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,8/6/1993,12:42 PM,97308,6.945,True,Marketing
1,Thomas,Male,3/31/1996,6:53 AM,61933,4.170,True,NaN
2,Maria,Female,4/23/1993,11:17 AM,130590,11.858,False,Finance
3,Jerry,Male,3/4/2005,1:00 PM,138705,9.340,True,Finance
4,Larry,Male,1/24/1998,4:47 PM,101004,1.389,True,Client Services
...,...,...,...,...,...,...,...,...
995,Henry,NaN,11/23/2014,6:09 AM,132483,16.655,False,Distribution
996,Phillip,Male,1/31/1984,6:30 AM,42392,19.675,False,Finance
997,Russell,Male,5/20/2013,12:39 PM,96914,1.421,False,Product
998,Larry,Male,4/20/2013,4:45 PM,60500,11.985,False,Business Development
999,Albert,Male,5/15/2012,6:24 PM,129949,10.169,True,Sales

In [122]:
emp_df.shape

(1000, 8)

In [123]:
emp_df.describe()

              Salary      Bonus %
count    1000.000000  1000.000000
mean    90662.181000    10.207555
std     32923.693342     5.528481
min     35013.000000     1.015000
25%     62613.000000     5.401750
50%     90428.000000     9.838500
75%    118740.250000    14.838000
max    149908.000000    19.944000

In [124]:
emp_df.dtypes

First Name            object
Gender                object
Start Date            object
Last Login Time       object
Salary                 int64
Bonus %              float64
Senior Management     object
Team                  object
dtype: object

In [125]:
emp_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   First Name         933 non-null    object
 1   Gender             855 non-null    object
 2   Start Date         1000 non-null   object
 3   Last Login Time    1000 non-null   object
 4   Salary             1000 non-null   int64
 5   Bonus %            1000 non-null   float64
 6   Senior Management  933 non-null    object
 7   Team               957 non-null    object
dtypes: float64(1), int64(1), object(6)
memory usage: 62.6+ KB

In [126]:
empdf1=emp_df.convert_dtypes()

In [127]:
empdf1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   First Name         933 non-null    string
 1   Gender             855 non-null    string
 2   Start Date         1000 non-null   string
 3   Last Login Time    1000 non-null   string
 4   Salary             1000 non-null   Int64
 5   Bonus %            1000 non-null   Float64
 6   Senior Management  933 non-null    boolean
 7   Team               957 non-null    string
dtypes: Float64(1), Int64(1), boolean(1), string(5)
memory usage: 58.7 KB

In [128]:
emp_df["Start Date"]=pd.to_datetime(emp_df["Start Date"])

In [129]:
emp_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   First Name         933 non-null    object
 1   Gender             855 non-null    object
 2   Start Date         1000 non-null   datetime64[ns]
 3   Last Login Time    1000 non-null   object
 4   Salary             1000 non-null   int64
 5   Bonus %            1000 non-null   float64
 6   Senior Management  933 non-null    object
 7   Team               957 non-null    object
dtypes: datetime64[ns](1), float64(1), int64(1), object(5)
memory usage: 62.6+ KB

In [130]:
emp_df.nunique()

First Name           200
Gender                 2
Start Date           972
Last Login Time      720
Salary               995
Bonus %              971
Senior Management      2
Team                  10
dtype: int64

In [131]:
emp_df.isnull().sum()

First Name            67
Gender               145
Start Date             0
Last Login Time        0
Salary                 0
Bonus %                0
Senior Management     67
Team                  43
dtype: int64

In [132]:
# replace nulls in gender cols with NO Gender
emp_df["Gender"]=emp_df["Gender"].fillna("No Gender")
emp_df["Gender"].isnull().sum()

0

In [133]:
emp_df.groupby("Gender").count()

,First Name,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
Gender,,,,,,,
Female,400,431,431,431,431,400,418
Male,395,424,424,424,424,395,398
No Gender,138,145,145,145,145,138,141

In [139]:
emp_df["Senior Management"]=emp_df["Senior Management"].fillna(emp_df["Senior Management"].mode)

In [142]:
emp_df

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,12:42 PM,97308,6.945,True,Marketing
1,Thomas,Male,1996-03-31,6:53 AM,61933,4.170,True,NaN
2,Maria,Female,1993-04-23,11:17 AM,130590,11.858,False,Finance
3,Jerry,Male,2005-03-04,1:00 PM,138705,9.340,True,Finance
4,Larry,Male,1998-01-24,4:47 PM,101004,1.389,True,Client Services
...,...,...,...,...,...,...,...,...
995,Henry,No Gender,2014-11-23,6:09 AM,132483,16.655,False,Distribution
996,Phillip,Male,1984-01-31,6:30 AM,42392,19.675,False,Finance
997,Russell,Male,2013-05-20,12:39 PM,96914,1.421,False,Product
998,Larry,Male,2013-04-20,4:45 PM,60500,11.985,False,Business Development
999,Albert,Male,2012-05-15,6:24 PM,129949,10.169,True,Sales

In [144]:
emp_df.groupby("Gender")["Gender"].count()

Gender
Female       431
Male         424
No Gender    145
Name: Gender, dtype: int64

In [149]:
emp_df.to_csv("Final_emp_df.csv")

In [150]:
df=pd.read_csv("Final_emp_df.csv")

In [151]:
df

,Unnamed: 0,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,0,Douglas,Male,1993-08-06,12:42 PM,97308,6.945,True,Marketing
1,1,Thomas,Male,1996-03-31,6:53 AM,61933,4.170,True,NaN
2,2,Maria,Female,1993-04-23,11:17 AM,130590,11.858,False,Finance
3,3,Jerry,Male,2005-03-04,1:00 PM,138705,9.340,True,Finance
4,4,Larry,Male,1998-01-24,4:47 PM,101004,1.389,True,Client Services
...,...,...,...,...,...,...,...,...,...
995,995,Henry,No Gender,2014-11-23,6:09 AM,132483,16.655,False,Distribution
996,996,Phillip,Male,1984-01-31,6:30 AM,42392,19.675,False,Finance
997,997,Russell,Male,2013-05-20,12:39 PM,96914,1.421,False,Product
998,998,Larry,Male,2013-04-20,4:45 PM,60500,11.985,False,Business Development
999,999,Albert,Male,2012-05-15,6:24 PM,129949,10.169,True,Sales